Repository: DanielFiller30/ScriptManager
Catalog: ScriptManager/*.lproj/Localizable.strings
Languages: de

# welcome-title
source: Welcome to your personal Script-Manager
de: Herzlich Willkommen zu deinem persönlichen Skript-Manager

# welcome-info
source: You can open your Script-Manager with the menubar symbol of your Mac. Before you add your first script, please have a look in your settings, they are important to offer that your scripts run successfully.
de: Du kannst deinen Skript-Manager über das neue Symbol in der Menubar deines Macs öffnen. Bevor du loslegst, solltest du einen Blick in deine Einstellungen werfen, die benötigt werden, um deine Skripte zum laufen zu bringen.

# welcome-info2
source: You can open the settings with the gear symbol:
de: Deine Einstellungen öffnest du in deinem Skript-Manager über das Zahnrad Symbol:

# welcome-info3
source: A new script can be added with the field 'Add new script'. With the displayed list you can run your script by a simple click. If your script is finished, you can get a notification (Activate in your settings) or you open your script-manager.
de: Ein neues Skript kannst du über die Auswahl 'Neues Skript hinzufügen' speichern. Über die Liste ist es dir dann ermöglicht, ganz einfach deine gespeicherten Skripte auszuführen. Ist dein Skript durchgelaufen, kannst du dir mithilfe von Mitteilungen (Aktivierung in den Einstellungen) das Ergebnis zeigen lassen, oder du öffnest deinen Skript-Manager.

# welcome-info4
source: This are the different result states for your script:
de: Hier siehst du zwei verschiedene Resultate für dein abgeschlossenes Skript:

# welcome-info5
source: A green checkmark signalizes that your script run successfully. A red cross symbol shows that your script has failed by an error. Therefore you can activate the logging function in your settings to get further informations. If you have activated the logging, you will see a red button which opens the specified path to your logs.
de: Ein grüner Haken bedeutet, dass dein Skript ohne Fehler abgeschlossen wurde. Ein rotes Kreuz bedeutet ein Fehler ist aufgetreten. Hier hilft es dir die Logging-Funktion über die Einstellung zu aktivieren. Bei aktivierter Logging-Funktion wird das Bild zu einer Schaltfläche mit rotem Hintergrund, über die du ganz einfach zu deinem für die Logs hinterlegten Pfad gelangst.

# welcome-toggle
source: Don't show again
de: Nicht mehr anzeigen

# welcome-close
source: Close window
de: Fenster schließen

# close-app-title
source: Terminate application
de: Anwendung beenden

# close-app-btn
source: Terminate
de: Beenden

# close-app-msg
source: Are you sure to terminate your script-manager?
de: Bist du sicher, dass du deinen Skript-Manager beenden möchtest?

# add-new-script
source: Add a new script
de: Neues Skript hinzufügen

# info-add-new-script
source: Test and save a new script for your personal list
de: Teste und füge ein neues Skript deiner Liste hinzu

# saved %@
source: Saved scripts (%@)
de: Gespeicherte Skripte (%@)

# empty-scripts
source: Add a new script, to run it here
de: Füge ein neues Skript hinzu, um es über diese Liste auszuführen

# name-add-script
source: Name for the script
de: Skriptname

# path-add-script
source: Script to execute
de: Auszuführendes Skript

# test-script
source: Test
de: Testen

# test-success
source: Script worked
de: Erfolgreich getestet

# test-failed
source: Script failed
de: Skript fehlerhaft

# save-script
source: Save
de: Speichern

# icon-script
source: Script-icon
de: Skript-Icon

# edit-script-title
source: Edit script
de: Skript anpassen

# edit-save
source: Save changes
de: Speichern

# edit-delete
source: Discard changes
de: Verwerfen

# path
source: Command:
de: Befehl:

# last-run
source: Last executed:
de: Zuletzt ausgeführt:

# edit-script
source: Edit
de: Anpassen

source: Open logs
de: Protokolle öffnen

# button-delete
source: Delete script
de: Skript löschen

# button-logs
source: Open logs
de: Protokolle öffnen

# button-edit
source: Modify script
de: Skript anpassen

source: Delete
de: Löschen

source: Cancel
de: Abbrechen

# delete-title
source: Remove script
de: Skript-Eintrag löschen

# delete-msg
source: Are you sure to remove this script from your list?
de: Bist du sicher, dass du dieses Skript aus deiner Liste entfernen möchtest?

source: Settings
de: Einstellungen

# settings-shell
source: Shell-settings
de: Terminal-Einstellungen

source: Shell-type
de: Shell-Typ

# path-shell
source: Path to shell
de: Pfad zur Shell

# path-profile
source: Path to profile
de: Pfad zum Profil

# settings-reset
source: Delete saved data
de: Gespeicherte Daten löschen

# settings-save
source: Save settings
de: Einstellungen speichern

# settings-delete-title
source: Delete saved scripts
de: Datenstand löschen

# settings-delete-msg
source: Are you sure to remove all the saved scripts from your list?
de: Bist du sicher, dass du deine gespeicherten Skripte aus deiner Liste entfernen möchtest?

# settings-logging
source: Activate error-logs
de: Fehler-Protokoll aktivieren

# path-logs
source: Path for logs
de: Pfad zu den Protokollen

# settings-notifications
source: Activate notifications
de: Mitteilungen aktivieren

# settings-color
source: Change primary color
de: Primärfarbe anpassen

# settings-autostart
source: Launch at login
de: Bei der Anmeldung öffnen

# settings-shortcut
source: Modify shortcuts
de: Tastenkurzbefehle festlegen

# settings-sc-1
source: Shortcut 1:
de: Kurzbefehl 1:

# settings-sc-2
source: Shortcut 2:
de: Kurzbefehl 2:

# settings-sc-3
source: Shortcut 3:
de: Kurzbefehl 3:

# settings-sc-4
source: Shortcut 4:
de: Kurzbefehl 4:

# settings-sc-5
source: Shortcut 5:
de: Kurzbefehl 5:

# notification-successfull-title %@
source: Script '%@' successfull finished
de: Skript '%@' abgeschlossen

# notification-failed-title %@
source: Skript '%@' failed
de: Skript '%@' fehlgeschlagen

# notification-successfull-subtitle
source: Your script has successfully finished. Run an other script in your menu-bar application.
de: Dein Skript wurde erfolgreich durchgeführt. Führe ein weiteres Skript über die Verwaltungsoberfläche aus.

# notification-failed-subtitle
source: Your script failed. Please check the error in your menu-bar application. Hint: Activate logging in your settings, to get further information for your error.
de: Dein Skript konnte nicht erfolgreich ausgeführt werden. Hinweis: Aktiviere das Logging in den Einstellungen, um mehr Informationen zu deinem Fehler zu erhalten.

# notification-start-title %@
source: Script '%@' is running
de: Skript '%@' wird ausgeführt

# notification-start-subtitle
source: Your script was called by a keyboard shortcut and is now running.
de: Dein Skript wurde durch einen Tastatur-Kurzbefehl ausgelöst und wird gerade ausgeführt.

# hint-shell-title
source: Shell-Type
de: Shell-Typ

# hint-shell-text
source: You can change your default type of shell. Use the type of shell you use in your terminal as well.
de: Du hast die Möglichkeit deine Standard-Shell zu ändern. Nutze bestmöglichst die Shell, die du in deinem Terminal auch verwendest.

# hint-profile-title
source: Profile
de: Profil

# hint-profile-text
source: If you are using a profile configuration for your shell then change your path to your profile file.
de: Falls du eine Profilkonfiguration für deine Shell verwendest, passe den Pfad zu dieser Datei an.

# hint-notifications-title
source: Notifications
de: Mitteilungen

# hint-notifications-text
source: When you activate notifications, you will get a push-up information when your running script has finished.
de: Wenn du die Mitteilungen aktiviert hast, wirst du automatisch über Push-up Mitteilungen darüber informiert, ob dein Skript erfolgreich durchgelaufen ist.

# hint-script-title
source: Script
de: Skript

# hint-script-text
source: Pleace notice that your script is running out of your root folder. Du kannst jeden beliebigen Befehl ausführen. Bei einer Folge von Befehlen, beachte, dass diese durhc ein ';' getrennt werden müssen.
de: Beachte dass du dich im Root-Verzeichnis deines Macs befindest. Du kannst jeden beliebigen Befehl ausführen. Bei einer Folge von Befehlen, beachte, dass diese durhc ein ';' getrennt werden müssen.

# hint-copied
source: Copied!
de: Kopiert!

# script-run
source: Start without output
de: Ohne Ausgabe starten

# script-run-output
source: Start and show output
de: Mit Ausgabe starten
